app/controllers/checklists_controller.rb

SELECT "checklists".* FROM "checklists"
---
  def index
    @checklists = Checklist.all

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "uPfpwpGsalVUpnF3PqVvyVepnir1"], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 ORDER BY "trips"."id" DESC LIMIT $2  [["user_id", 41], ["LIMIT", 1]]
INSERT INTO "checklists" ("todoList") VALUES ($1) RETURNING "id"  [["todoList", "toothbrush"]]
SELECT "checklists".* FROM "checklists" WHERE "checklists"."trip_id" = $1  [["trip_id", 58]]
---
  def create
    # @checklist = Checklist.create :todoList => params[:todoList][0][:name]
    @user = User.find_by :uid => params[:uid]
    @trip = @user.trips.last
    params[:todoList].each do |t|
      @trip.checklists << Checklist.create(:todoList => t[:name])
    end
    if @trip.checklists.any?

SELECT  "checklists".* FROM "checklists" WHERE "checklists"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def show
    @checklist = Checklist.find (params[:id])