app/controllers/trips_controller.rb

  def create
    @trip = Trip.create trip_params
    @user = User.find_by :uid => params[:uid]
---
INSERT INTO "trips" ("start", "end", "location") VALUES ($1, $2, $3) RETURNING "id"  [["start", "2021-09-12"], ["end", "2021-09-13"], ["location", "Butt"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2

  def show
    @trip = Trip.find (params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]