app/controllers/users_controller.rb

  def show
    user = User.find(params[:id])
    trip = Trip.all.where(user_id: params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 9]]