app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "checklists".* FROM "checklists" WHERE "checklists"."user_id" = $1  [["user_id", 46]]
---
  def show
    user = User.find(params[:id])
    checklist = Checklist.all.where(user_id: params[:id])

INSERT INTO "users" ("name", "email", "uid") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Neil"], ["email", "anon7@hotmail.com"], ["uid", "bvaLJLrvzQeK9ysjBsx93CYsyUD2"]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "anon4@hotmail.com"], ["LIMIT", 1]]
---
  def create_user
resp = HTTParty.post("https://identitytoolkit.googleapis.com/v1/accounts:signUp?key=#{ENV['FIREBASE_API_KEY']}",
        :body => {
            name: params[:name],
            email: params[:email],
            password: params[:password]
            }.to_json,
        :headers => {'Content-Type' => 'application/json'}
        )

        if resp.key?('idToken')
          user = User.create(name: params["name"], email: params["email"], uid: resp["localId"])
            puts user.errors.full_messages if user.errors.any?